Revit 2017 API
RevitLinkLoadResult Constructor
 Constructs a new copy of the input LinkLoadResult object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public RevitLinkLoadResult(
	RevitLinkLoadResult other
)
Visual Basic
Public Sub New ( _
	other As RevitLinkLoadResult _
)
Visual C++
public:
RevitLinkLoadResult(
	RevitLinkLoadResult^ other
)
Parameters
other
Type: Autodesk.Revit.DB.RevitLinkLoadResult
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
RevitLinkLoadResult Class
Autodesk.Revit.DB Namespace